app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 51]]

  def create
    @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-29 19:38:45.686981"], ["title", "test"], ["updated_at", "2014-08-29 19:38:45.686981"], ["url", "adsfasdf"]]