app/controllers/photos_controller.rb

  def index
    @photos = Photo.all.order("vote_count DESC").limit(20)
---
SELECT  "photos".* FROM "photos"   ORDER BY vote_count DESC LIMIT 20