app/controllers/sessions_controller.rb

	def create
		user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'george.x.zeng@gmail.com' LIMIT 1