app/controllers/votes_controller.rb

SELECT "photos".* FROM "photos"
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 7]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "value", "votable_id", "votable_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-08-29 19:05:51.523023"], ["updated_at", "2014-08-29 19:05:51.523023"], ["user_id", 1], ["value", 1], ["votable_id", 7], ["votable_type", "Photo"]]
---
  def create
    @photos = Photo.all  ## WHY DO WE NEED THIS LINE (WE DO, BUT I DON'T KNOW WHY)
    photo = Photo.find(params[:photo_id])
    vote = photo.votes.new(user_id: session[:user_id], votable_id: photo.id, votable_type: "Photo", value: 1)
    if current_user.already_voted_this_photo?(photo)
      render 'photos/index' and return
    else
      vote.save